In [3]:
import pandas as pd
import numpy as np

In [4]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, 
dtype='l'))
print(s1, s2, s3)

0     2
1     3
2     4
3     1
4     3
     ..
95    2
96    2
97    1
98    2
99    4
Length: 100, dtype: int32 0     2
1     3
2     3
3     3
4     2
     ..
95    1
96    3
97    2
98    3
99    3
Length: 100, dtype: int32 0     24525
1     17766
2     17115
3     22211
4     24400
      ...
95    13359
96    11243
97    21316
98    28112
99    28811
Length: 100, dtype: int32

In [5]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  2  2  24525
1  3  3  17766
2  4  3  17115
3  1  3  22211
4  3  2  24400

In [6]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 
'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            24525
1      3       3            17766
2      4       3            17115
3      1       3            22211
4      3       2            24400

In [8]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       3
2       4
3       1
4       3
..    ...
95  13359
96  11243
97  21316
98  28112
99  28811

[300 rows x 1 columns]

In [9]:
len(bigcolumn)
300

300

In [10]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        3
2        4
3        1
4        3
..     ...
295  13359
296  11243
297  21316
298  28112
299  28811

[300 rows x 1 columns]